export const ErrorCodeMap = {
  // 10000 - 99999 业务操作错误

  10000: '请求校验异常',
  10001: '用户名已存在',
  10002: '验证码错误',
  10003: '用户名或密码错误',
  10004: '旧密码与原密码不一致',
  10005: '注册邮箱已存在',
  10006: '删除失败',
  10007: '新密码与原密码相同',

  // token
  11001: '登录无效或无权限访问',
  11002: '登录身份已过期',
  11003: '无权限，请联系管理员申请权限',

  // user
  12000: '用户不存在',
  12001: '用户角色名错误',

  //category
  13000: '分类不存在',
  13001: '分类名重复',

  //tag
  14000: '标签不存在',
  14001: '标签名重复',

  //post
  15000: '文章不存在',

  //config
  16000:'配置项不存在',
  16001:'配置项已存在',

  //crud
  20000:'创建失败',
  20001:'更新失败',
  20002:'删除失败'
}
